Revit 2026 API

# CompoundStructureCutoffHeight Property

---

Horizontal segments below or at the cutoff height have their distance to the wall bottom fixed, those above have their distance to the wall top fixed.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double CutoffHeight { get; set; }
```
```vb
Public Property CutoffHeight As Double
	Get
	Set
```
```cpp
public:
property double CutoffHeight {
	double get ();
	void set (double value);
}
```
```fsharp
member CutoffHeight : float with get, set
```

#### Property Value

Double The cutoff height of this CompoundStructure.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This operation is valid only for vertically compound structures. |

This allows layers with one horizontal segment above and one below this line to be of variable height.

#### Reference

CompoundStructure Class

Autodesk.Revit.DB Namespace